Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-28_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: Further Reading | Inclusive Design Patterns
ja: 関連資料

source: Thank you for reading my book!
ja: 本書をお読みいただき、ありがとうございました。

source: One of the best things about writing a book about patterns is that there are always more patterns to talk about.
ja: パターンに関する書籍の執筆で最高な点の1つは、取り上げるべきパターンがいくらでもあることです。

source: And you know what that means: I can write a sequel!
ja: そうです、つまりは続編を書けるということです！

source: If you can think of any inclusive patterns you’d like me to explore, you can find me on Twitter as @heydonworks.
ja: 私に研究してほしいインクルーシブパターンがある方は、Twitter（@heydonworks）から声をかけてください。

source: Also, if you spot any inconsistencies or errors here (it happens!), please contact myself or Smashing Magazine so we can update the errata page.
ja: また、本書の矛盾やエラー（たまにあるのです！）に気付いた方は、私またはSmashing Magazineにご連絡ください。正誤表ページ（脚注209）を更新させて頂きます。

source: In the meantime, here’s a list of resources I recommend for reading about and around inclusive design, covering everything from responsive design to UX, technical accessibility, performance, and internationalization.
ja: では最後に、インクルーシブデザインに関連するお勧めの参考資料をご紹介します。レスポンシブデザインからUX、技術的なアクセシビリティ、パフォーマンス、国際化まで、ありとあらゆるトピックを扱っています。

source: Books
ja: 書籍

source: •A Web For Everyone by Sarah Horton and Whitney Quesenbery
ja: •『A Web For Everyone』Sarah Horton、Whitney Quesenbery著：http://smashed.by/aweb4everyone

source: •Apps For All by Heydon Pickering
ja: •『Apps For All』Heydon Pickering著：http://smashed.by/apps4all 日本語版：『コーディングWebアクセシビリティ - WAI-ARIAで実現するマルチデバイス環境のWebアプリケーション』ヘイドン・ピカリング著（ボーンデジタル刊）

source: •Designing With Web Standards by Jeffrey Zeldman with Ethan Marcotte
ja: •『Designing With Web Standards』Jeffrey Zeldman、Ethan Marcotte著：http://smashed.by/webstandards 日本語版：『Designing with Web Standards―XHTML+CSSを中心とした「Web標準」によるデザインの実践』ジェフリー・ゼルドマン、イーサン・マルコッテ著（毎日コミュニケーションズ刊）

source: •Adaptive Web Design by Aaron Gustafson
ja: •『Adaptive Web Design』Aaron Gustafson著：http://adaptivewebdesign.info/

source: •The Design Of Everyday Things by Donald A Norman
ja: •『The Design Of Everyday Things』Donald A Norman著：http://smashed.by/everydaythings 日本語版：『誰のためのデザイン？認知科学者のデザイン原論』ドナルド・A・ノーマン著（新曜社刊）

source: •Colour Accessibility by Geri Coady
ja: •『Colour Accessibility』Geri Coady著：https://gumroad.com/l/loura11y

source: •Don’t Make Me Think by Steve Krug
ja: •『Don’t Make Me Think』Steve Krug著：http://smashed.by/dontmakemethink 日本語版：『超明快 Webユーザビリティ―ユーザーに「考えさせない」デザインの法則』スティーブ・クルーグ著（ビー・エヌ・エヌ新社刊）

source: •Responsible Responsive Design by Scott Jehl
ja: •『Responsible Responsive Design』Scott Jehl著：http://smashed.by/resres

source: •Web Performance by Andy Davis
ja: •『Web Performance』Andy Davis著：http://andydavies.me/books/#webperformance

source: •Front-end Style Guides by Anna Debenham
ja: •『Front-end Style Guides』Anna Debenham著：http://www.maban.co.uk/projects/front-end-style-guides/

source: •International User Research by Chui Chui Tan
ja: •『International User Research』Chui Chui Tan著：https://gumroad.com/l/international-user-research

source: •Service Design: From Insight To Implementation by Andy Polaine, Lavrans Løvlie, Ben Reason
ja: •『Service Design — From Insight To Implementation』Andy Polaine、Lavrans Løvlie、Ben Reason著：http://smashed.by/servicedesign

source: •Design Meets Disability by Graham Pullin
ja: •『Design Meets Disability』Graham Pullin著：http://smashed.by/desdis

source: •The Joy of UX — User Experience and Interactive Design for Developers by David Platt
ja: •『The Joy of UX — User Experience and Interactive Design for Developers』David Platt著：http://smashed.by/joyux

source: •Including Your Missing 20% By Embedding Web And Mobile Accessibility by Jonathan Hassell
ja: •『Including Your Missing 20% By Embedding Web And Mobile Accessibility』Jonathan Hassell著：http://www.hassellinclusion.com/landing/book/

source: •Design For Real Life by Eric Meyer & Sara Wachter-Boettcher
ja: •『Design For Real Life』Eric Meyer、Sara Wachter- Boettcher著：http://smashed.by/reallife

source: •The Timeless Way Of Building by Christopher Alexander
ja: •『The Timeless Way Of Building』Christopher Alexander著：http://smashed.by/timelessway

source: Blogs
ja: ブログ

source: •Marco’s Accessibility Blog
ja: •Marco’s Accessibility Blog：https://www.marcozehe.de/

source: •The Paciello Group’s blog
ja: •Paciello Groupのブログ：https://www.paciellogroup.com/blog/

source: •Accessibility Wins
ja: •Accessibility Wins：https://a11ywins.tumblr.com/

source: •Tink.uk (Léonie Watson)
ja: •Tink.uk：http://tink.uk/（Léonie Watson）

source: •Adrian Roselli
ja: •Adrian Roselli：http://adrianroselli.com/

source: •Simply Accessible’s blog
ja: •Simply Accessible：http://simplyaccessible.com/articles/

source: •Web Axe (Dennis Lembrée)
ja: •Web Axe：http://www.webaxe.org/（Dennis Lembrée）

source: •Web Aim’s blog
ja: •Web Aimのブログ：http://webaim.org/blog/

source: •Karl Groves
ja: •Karl Groves：http://www.karlgroves.com/

source: •SSB Bart Group’s blog
ja: •SSB Bart Groupのブログ：http://www.ssbbartgroup.com/blog/

source: •Deque’s blog
ja: •Dequeのブログ：http://www.deque.com/blog/

source: •Terrill Thompson
ja: •Terrill Thompson：http://terrillthompson.com/blog/

source: •The Nielsen Norman Group blog
ja: •Nielsen Norman Group：https://www.nngroup.com/articles/

source: •The GOV.UK accessibility blog
ja: •GOV.UK accessibility blog：https://accessibility.blog.gov.uk/

source: •lukew (Luke Wroblewski)
ja: •lukew：http://www.lukew.com/ff/（Luke Wroblewski）

source: •UX Booth Accessibility
ja: •UX Booth：http://smashed.by/a11yforms

source: More From Smashing Magazine
ja: Smashing Magazineの関連書籍

source: •Apps For All: Coding Accessible Web Applicationsby Heydon Pickering
ja: •『Apps For All: Coding Accessible Web Applications』Heydon Pickering著 日本語版：『コーディングWebアクセシビリティ - WAI-ARIAで実現するマルチデバイス環境のWebアプリケーション』ヘイドン・ピカリング著（ボーンデジタル刊）

source: •Hardboiled Web Design: Fifth Anniversary Editionby Andy Clarke
ja: •『Hardboiled Web Design: Fifth Anniversary Edition 』Andy Clarke著

source: •Smashing Book #5: Real-Life Responsive Web DesignOur latest web community book with chapters contributed by John Allsopp, Daniel Mall, Vitaly Friedman, Eileen Webb, Sara Soueidan, Zoe M. Gillenwater, Bram Stein, Yoav Weiss, Fabio Carneiro, Tom Maslen, Ben Callahan and Andy Clarke.
ja: •『Smashing Book #5: Real-Life Responsive Web Design』Smashing Magazineの最新のWebコミュニティブック。John Allsopp、Daniel Mall、Vitaly Friedman、Eileen Webb、Sara Soueidan、Zoe M.Gillenwater、Bram Stein、Yoav Weiss、Fabio Carneiro、Tom Maslen、Ben Callahan、Andy Clarkeが各章を執筆。

source: •Digital Adaptation by Paul Boag
ja: •『Digital Adaptation』Paul Boag著

source: •Smashing Book #4: New Perspectives On Web Design Our 4th web community book written by Harry Roberts, Nicholas Zakas, Christian Heilmann, Tim Kadlec, Mat Marquis, Addy Osmani, Aaron Gustafson, Paul Tero, Marko Dugonjić, Corey Vilhauer, Rachel Andrew, Nishant Kothary and Christopher Murphy.
ja: •『Smashing Book #4 : New Perspectives on Web Design』Smashing Magazineの4冊目のWebコミュニティブック。Harry Roberts、Nicholas Zakas、Christian Heilmann、Tim Kadlec、Mat Marquis、Addy Osmani、Aaron Gustafson、Paul Tero、Marko Dugonjić、Corey Vilhauer、Rachel Andrew、Nishant Kothary、Christopher Murphy著。

source: Visit smashingmagazine.com/books/ for our full list of titles.
ja: 全書籍のリストはsmashingmagazine.com/books/をご覧ください。
